patches535/diffs/smali_classes6/com/google/common/collect/Collections2$PermutationCollection.smali.patch
--- a/smali_classes6/com/google/common/collect/Collections2$PermutationCollection.smali
+++ b/smali_classes6/com/google/common/collect/Collections2$PermutationCollection.smali
@@ -50,12 +50,9 @@
     .line 1
     invoke-direct {p0}, Ljava/util/AbstractCollection;-><init>()V
 
-    .line 2
-    .line 3
     .line 4
     iput-object p1, p0, Lcom/google/common/collect/Collections2$PermutationCollection;->inputList:Lcom/google/common/collect/ImmutableList;
 
-    .line 5
     .line 6
     return-void
 .end method
@@ -72,24 +69,18 @@
     .line 1
     instance-of v0, p1, Ljava/util/List;
 
-    .line 2
     .line 3
     if-eqz v0, :cond_0
 
-    .line 4
     .line 5
     check-cast p1, Ljava/util/List;
 
-    .line 6
     .line 7
     iget-object p0, p0, Lcom/google/common/collect/Collections2$PermutationCollection;->inputList:Lcom/google/common/collect/ImmutableList;
 
-    .line 8
     .line 9
     invoke-static {p0, p1}, Lcom/google/common/collect/Collections2;->access$000(Ljava/util/List;Ljava/util/List;)Z
 
-    .line 10
-    .line 11
     .line 12
     move-result p0
 
@@ -128,16 +119,12 @@
     .line 1
     new-instance v0, Lcom/google/common/collect/Collections2$PermutationIterator;
 
-    .line 2
     .line 3
     iget-object p0, p0, Lcom/google/common/collect/Collections2$PermutationCollection;->inputList:Lcom/google/common/collect/ImmutableList;
 
-    .line 4
     .line 5
     invoke-direct {v0, p0}, Lcom/google/common/collect/Collections2$PermutationIterator;-><init>(Ljava/util/List;)V
 
-    .line 6
-    .line 7
     .line 8
     return-object v0
 .end method
@@ -148,20 +135,15 @@
     .line 1
     iget-object p0, p0, Lcom/google/common/collect/Collections2$PermutationCollection;->inputList:Lcom/google/common/collect/ImmutableList;
 
-    .line 2
     .line 3
     invoke-virtual {p0}, Ljava/util/AbstractCollection;->size()I
 
-    .line 4
-    .line 5
     .line 6
     move-result p0
 
     .line 7
     invoke-static {p0}, Lcom/google/common/math/IntMath;->factorial(I)I
 
-    .line 8
-    .line 9
     .line 10
     move-result p0
 
@@ -175,44 +157,30 @@
     .line 1
     new-instance v0, Ljava/lang/StringBuilder;
 
-    .line 2
     .line 3
     invoke-direct {v0}, Ljava/lang/StringBuilder;-><init>()V
 
-    .line 4
-    .line 5
     .line 6
     const-string v1, "permutations("
 
-    .line 7
     .line 8
     invoke-virtual {v0, v1}, Ljava/lang/StringBuilder;->append(Ljava/lang/String;)Ljava/lang/StringBuilder;
 
-    .line 9
-    .line 10
     .line 11
     iget-object p0, p0, Lcom/google/common/collect/Collections2$PermutationCollection;->inputList:Lcom/google/common/collect/ImmutableList;
 
-    .line 12
     .line 13
     invoke-virtual {v0, p0}, Ljava/lang/StringBuilder;->append(Ljava/lang/Object;)Ljava/lang/StringBuilder;
 
-    .line 14
-    .line 15
     .line 16
     const-string p0, ")"
 
-    .line 17
     .line 18
     invoke-virtual {v0, p0}, Ljava/lang/StringBuilder;->append(Ljava/lang/String;)Ljava/lang/StringBuilder;
 
-    .line 19
-    .line 20
     .line 21
     invoke-virtual {v0}, Ljava/lang/StringBuilder;->toString()Ljava/lang/String;
 
-    .line 22
-    .line 23
     .line 24
     move-result-object p0
 
